set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F126.v}
elaborate F126
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F126.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F126.txt
uplevel #0 { report_area -nosplit } > ../Area/F126.txt
