set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F131.v}
elaborate F131
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F131.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F131.txt
uplevel #0 { report_area -nosplit } > ../Area/F131.txt
