set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F135.v}
elaborate F135
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F135.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F135.txt
uplevel #0 { report_area -nosplit } > ../Area/F135.txt
