set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F150.v}
elaborate F150
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F150.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F150.txt
uplevel #0 { report_area -nosplit } > ../Area/F150.txt
