set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F154.v}
elaborate F154
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F154.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F154.txt
uplevel #0 { report_area -nosplit } > ../Area/F154.txt
