set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F155.v}
elaborate F155
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F155.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F155.txt
uplevel #0 { report_area -nosplit } > ../Area/F155.txt
