set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F164.v}
elaborate F164
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F164.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F164.txt
uplevel #0 { report_area -nosplit } > ../Area/F164.txt
