set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F17.v}
elaborate F17
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F17.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F17.txt
uplevel #0 { report_area -nosplit } > ../Area/F17.txt
