set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F197.v}
elaborate F197
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F197.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F197.txt
uplevel #0 { report_area -nosplit } > ../Area/F197.txt
