set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F198.v}
elaborate F198
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F198.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F198.txt
uplevel #0 { report_area -nosplit } > ../Area/F198.txt
