set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F230.v}
elaborate F230
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F230.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F230.txt
uplevel #0 { report_area -nosplit } > ../Area/F230.txt
