set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F260.v}
elaborate F260
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F260.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F260.txt
uplevel #0 { report_area -nosplit } > ../Area/F260.txt
