set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F267.v}
elaborate F267
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F267.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F267.txt
uplevel #0 { report_area -nosplit } > ../Area/F267.txt
