set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F270.v}
elaborate F270
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F270.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F270.txt
uplevel #0 { report_area -nosplit } > ../Area/F270.txt
