set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F29.v}
elaborate F29
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F29.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F29.txt
uplevel #0 { report_area -nosplit } > ../Area/F29.txt
