set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F296.v}
elaborate F296
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F296.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F296.txt
uplevel #0 { report_area -nosplit } > ../Area/F296.txt
