set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F301.v}
elaborate F301
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F301.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F301.txt
uplevel #0 { report_area -nosplit } > ../Area/F301.txt
