set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F304.v}
elaborate F304
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F304.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F304.txt
uplevel #0 { report_area -nosplit } > ../Area/F304.txt
