set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F310.v}
elaborate F310
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F310.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F310.txt
uplevel #0 { report_area -nosplit } > ../Area/F310.txt
