set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F318.v}
elaborate F318
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F318.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F318.txt
uplevel #0 { report_area -nosplit } > ../Area/F318.txt
