set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F320.v}
elaborate F320
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F320.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F320.txt
uplevel #0 { report_area -nosplit } > ../Area/F320.txt
