set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F322.v}
elaborate F322
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F322.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F322.txt
uplevel #0 { report_area -nosplit } > ../Area/F322.txt
