set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F324.v}
elaborate F324
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F324.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F324.txt
uplevel #0 { report_area -nosplit } > ../Area/F324.txt
