set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F343.v}
elaborate F343
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F343.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F343.txt
uplevel #0 { report_area -nosplit } > ../Area/F343.txt
