set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F368.v}
elaborate F368
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F368.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F368.txt
uplevel #0 { report_area -nosplit } > ../Area/F368.txt
