set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F376.v}
elaborate F376
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F376.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F376.txt
uplevel #0 { report_area -nosplit } > ../Area/F376.txt
