set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F38.v}
elaborate F38
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F38.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F38.txt
uplevel #0 { report_area -nosplit } > ../Area/F38.txt
