set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F386.v}
elaborate F386
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F386.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F386.txt
uplevel #0 { report_area -nosplit } > ../Area/F386.txt
