set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F391.v}
elaborate F391
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F391.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F391.txt
uplevel #0 { report_area -nosplit } > ../Area/F391.txt
