set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F40.v}
elaborate F40
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F40.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F40.txt
uplevel #0 { report_area -nosplit } > ../Area/F40.txt
