set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F45.v}
elaborate F45
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F45.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F45.txt
uplevel #0 { report_area -nosplit } > ../Area/F45.txt
