set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F54.v}
elaborate F54
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F54.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F54.txt
uplevel #0 { report_area -nosplit } > ../Area/F54.txt
