set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F57.v}
elaborate F57
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F57.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F57.txt
uplevel #0 { report_area -nosplit } > ../Area/F57.txt
