set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F61.v}
elaborate F61
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F61.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F61.txt
uplevel #0 { report_area -nosplit } > ../Area/F61.txt
