set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F67.v}
elaborate F67
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F67.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F67.txt
uplevel #0 { report_area -nosplit } > ../Area/F67.txt
