set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F89.v}
elaborate F89
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F89.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F89.txt
uplevel #0 { report_area -nosplit } > ../Area/F89.txt
