set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F9.v}
elaborate F9
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F9.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F9.txt
uplevel #0 { report_area -nosplit } > ../Area/F9.txt
