set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F91.v}
elaborate F91
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F91.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F91.txt
uplevel #0 { report_area -nosplit } > ../Area/F91.txt
