set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F92.v}
elaborate F92
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F92.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F92.txt
uplevel #0 { report_area -nosplit } > ../Area/F92.txt
