set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F93.v}
elaborate F93
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F93.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F93.txt
uplevel #0 { report_area -nosplit } > ../Area/F93.txt
