set power_preserve_rtl_hier_names "true"
analyze -format verilog { ../source/Verilogs/F97.v}
elaborate F97
link
uniquify -force
compile -map_effort medium
change_names -rules verilog -hierarchy
write -format verilog -hierarchy -output ../netlist/F97.v
uplevel #0 { report_power -analysis_effort low } > ../Power/F97.txt
uplevel #0 { report_area -nosplit } > ../Area/F97.txt
